# some nice inspirations:
#   - plugins of the antidote developer:
#     https://github.com/mattmc3/zdotdir/blob/main/.zsh_plugins.txt

# see https://github.com/getantidote/use-omz?tab=readme-ov-file
getantidote/use-omz

# alternative: choose the libs one-by-one
#    ohmyzsh/ohmyzsh path:lib/FILENAME.ZSH
# to use all, uncomment the following:
#ohmyzsh/ohmyzsh path:lib

# macOS specific plugins
ohmyzsh/ohmyzsh path:plugins/macos              conditional:is-macos

# let's set this first, because it will set the homebrew path ...
# hopefully ...
ohmyzsh/ohmyzsh path:plugins/brew

# some shell niceties
atuinsh/atuin   path:/                                                  # sqlite-based shell history
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/dircycle                                   # ctrl-shift-(left,right)
ohmyzsh/ohmyzsh path:plugins/direnv             conditional:has-direnv
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z                               # ctrl-z to return to backgrounded job
ohmyzsh/ohmyzsh path:plugins/gnu-utils                                  # use g* for gnu utils, NOT script-safe!
ohmyzsh/ohmyzsh path:plugins/jump                                       # https://is.gd/cIia5E
ohmyzsh/ohmyzsh path:plugins/zoxide             conditional:has-zoxide  # j/z DIRNAME

# dev specific
ohmyzsh/ohmyzsh path:plugins/virtualenvwrapper                          # auto-(de-)activate venvs

# disabled
#ohmyzsh/ohmyzsh path:plugins/globalias                                 # unpack aliases
#ohmyzsh/ohmyzsh path:plugins/magic-enter                               # execute commands on "empty" ENTER

# tool-specific
Aloxaf/fzf-tab        path:/                    conditional:has-fzf     # fzf-tab, with preview after cd
fdellwing/zsh-bat     path:/                                            # replace cat with bat
ohmyzsh/ohmyzsh       path:plugins/asdf
ohmyzsh/ohmyzsh       path:plugins/aws
ohmyzsh/ohmyzsh       path:plugins/docker       conditional:has-docker
ohmyzsh/ohmyzsh       path:plugins/fzf          conditional:not-ubuntu-minimized
ohmyzsh/ohmyzsh       path:plugins/git
ohmyzsh/ohmyzsh       path:plugins/git-extras                           # git-extras completions
ohmyzsh/ohmyzsh       path:plugins/podman
ohmyzsh/ohmyzsh       path:plugins/kubectl
ohmyzsh/ohmyzsh       path:plugins/rsync
ohmyzsh/ohmyzsh       path:plugins/ssh                                  # maybe unneeded
ohmyzsh/ohmyzsh       path:plugins/terraform                            # mainly aliases
ohmyzsh/ohmyzsh       path:plugins/uv
paulirish/git-open    path:/                                            # "git open" :)))
romkatv/zsh-bench     kind:path                                         # ... ?
z-shell/zsh-eza       path:/                    conditional:has-eza

# commented out so far
#ohmyzsh/ohmyzsh path:plugins/rclone                                     # stupid error messages on linux??
#ohmyzsh/ohmyzsh path:plugins/git-commit                                 # conventional commit aliases
#https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/gitfast
#https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/lando
#https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/mise
#https://github.com/zinic/tmux-cssh/

# Add core plugins that make Zsh a bit more like Fish

# I CANNOT STAND THIS PLUGIN.
#marlonrichert/zsh-autocomplete

zsh-users/zsh-completions path:src kind:fpath
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search # we STILL NEED to key-bind it (see below)

# this, apparently, should be last.
zdharma-continuum/fast-syntax-highlighting
