# by https://github.com/Homebrew/homebrew-bundle
tap "buo/cask-upgrade"
tap "hashicorp/tap"

# super essential
cask "contexts"
cask "a-better-finder-rename"
cask "dropbox"
cask "dropzone"
# "exactscan" ist NOT "exactscan PRO"
cask "firefox"
cask "gpg-suite"
brew "pinentry-mac"       # required for gpg-suite ...
cask "hazel"
cask "iterm2"
cask "nextcloud"
cask "onedrive"
cask "telegram"           # the correct one
cask "typinator"
cask "whatsapp"
# pastebot -> see below "mac app store"
cask "lunar"

# app store command line interface
brew "mas"

# editors
cask "jetbrains-toolbox"
cask "sublime-text@dev"
cask "vscodium"
cask "zed"

# replace Mac OS command line utils
brew "bash"
brew "coreutils"
brew "curl"
brew "emacs"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "grep"
brew "openssl"
brew "stow"
brew "vim"

# previously uninstalled command line utils
brew "atuin"
brew "eza"
brew "dos2unix"
brew "entr"
brew "fzf"
brew "fzy"
brew "git"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "jq"
brew "nmap"
brew "parallel"
brew "pdfcpu"
brew "pdftk"
brew "poppler"
brew "pv"
brew "spacer"
brew "ripgrep"
brew "the_silver_searcher"      # "ag" :)
brew "tmux"
brew "watch"
brew "wget"
brew "xz"
brew "yq"
brew "zoxide"

# coding and work related
brew "autoenv"
brew "ansible"
brew "awscli"
brew "git-delta"
brew "doctl"
brew "helm"
brew "helmsman"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "multimarkdown"
brew "pgcli"
brew "pyenv"
brew "pyenv-virtualenv"
brew "stern"
brew "telnet"
brew "hashicorp/terraform"
brew "uv"
cask "boop"
cask "clop"
cask "devutils"
cask "fork"
cask "podman-desktop"
cask "postgres-unofficial"
cask "slack"

# (mac) ui appliccations
cask "cyberduck"
cask "mountain-duck"
cask "imageoptim"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "libreoffice"
cask "logi-options+"
cask "pdf-expert"
cask "rocket"
cask "typora"             # markdown editor
cask "wireshark"

# misc
brew "croc"
brew "yt-dlp"

# fonts
cask "font-commit-mono"
cask "font-dm-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-inconsolata"
cask "font-intel-one-mono"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-monoid"
cask "font-noto-mono"
cask "font-noto-sans-mono"
cask "font-nova-mono"
cask "font-pt-mono"
cask "font-roboto-mono"
cask "font-sf-mono"
cask "font-share-tech-mono"
cask "font-source-code-pro"
cask "font-ubuntu-mono"
# nerd
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"
# powerline
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-sf-mono-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"

# mac app store applications
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "Keka", id: 470158793
mas "MoneyMoney", id: 872698314
mas "Pastebot", id: 1179623856
mas "PhotoSync", id: 418818452
mas "rcmd", id: 1596283165
mas "The Unarchiver", id: 425424353
